**Terraform Format and Style🖌** `success`
**Terraform Initialization ⚙️** `success`
**Terraform Plan 📖** `success`
**Terraform Validation 🤖** `success`

<details><summary>Show Plan</summary>

```hcl
module.aws_fastmail_wtmn_net.data.dns_a_record_set.mail: Reading...
module.aws_fastmail_georgewitteman_me.data.dns_a_record_set.mail: Reading...
module.aws_fastmail_witteman_me.data.dns_a_record_set.mail: Reading...
module.aws_fastmail_georgewitteman_com.data.dns_a_record_set.mail: Reading...
data.tls_certificate.github: Reading...
data.github_user.georgewitteman: Reading...
data.github_repository.terraform: Reading...
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.spf: Refreshing state... [id=37701469]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_submission: Refreshing state... [id=26161944]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.mx_20[0]: Refreshing state... [id=37701465]
module.aws_fastmail_wtmn_net.data.dns_a_record_set.mail: Read complete after 0s [id=mail.fastmail.com]
module.aws_fastmail_georgewitteman_me.data.dns_a_record_set.mail: Read complete after 0s [id=mail.fastmail.com]
module.aws_fastmail_georgewitteman_com.data.dns_a_record_set.mail: Read complete after 0s [id=mail.fastmail.com]
module.aws_fastmail_witteman_me.data.dns_a_record_set.mail: Read complete after 0s [id=mail.fastmail.com]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.mx_10[0]: Refreshing state... [id=37701461]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.mx_10[0]: Refreshing state... [id=37701467]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.mx_20[0]: Refreshing state... [id=37701458]
dnsimple_zone_record.github_redirect: Refreshing state... [id=26395267]
data.tls_certificate.github: Read complete after 0s [id=ce2f7f71e49a92b06847b8c74d5b44925a94ff6e]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_imaps: Refreshing state... [id=26880816]
data.github_repository.terraform: Read complete after 1s [id=terraform]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_submission: Refreshing state... [id=26880815]
data.github_user.georgewitteman: Read complete after 1s [id=5918935]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_pop3s: Refreshing state... [id=26161949]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.dmarc[0]: Refreshing state... [id=26161942]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_caldavs: Refreshing state... [id=26161939]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.mail: Refreshing state... [id=26161935]
module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.verify_cname: Refreshing state... [id=28036170]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.bimi: Refreshing state... [id=32326126]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.bimi: Refreshing state... [id=32326124]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.bimi: Refreshing state... [id=32326125]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_jmap: Refreshing state... [id=26161947]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_pop3s: Refreshing state... [id=26161962]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.dkim[2]: Refreshing state... [id=26161933]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_caldavs: Refreshing state... [id=26161946]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.dkim[0]: Refreshing state... [id=26161953]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.dkim[1]: Refreshing state... [id=26161954]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.dkim[2]: Refreshing state... [id=26161955]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_imaps: Refreshing state... [id=26161958]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.dkim[0]: Refreshing state... [id=26161931]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.dkim[1]: Refreshing state... [id=26161932]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_carddavs: Refreshing state... [id=26880813]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_jmap: Refreshing state... [id=26880820]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.mail: Refreshing state... [id=26880812]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_caldavs: Refreshing state... [id=26880814]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.spf: Refreshing state... [id=37701457]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.mx_10[0]: Refreshing state... [id=37701466]
module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.www_cname: Refreshing state... [id=28036169]
module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.a_records[2]: Refreshing state... [id=37701473]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.srv_pop3s: Refreshing state... [id=29377246]
module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.a_records[3]: Refreshing state... [id=37701475]
module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.a_records[0]: Refreshing state... [id=37701474]
module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.a_records[1]: Refreshing state... [id=37701460]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.spf: Refreshing state... [id=37701470]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.bimi: Refreshing state... [id=32326123]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.srv_submission: Refreshing state... [id=29377242]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.srv_carddavs: Refreshing state... [id=29377238]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.mx_20[0]: Refreshing state... [id=37701476]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.srv_imaps: Refreshing state... [id=29377249]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.dmarc[0]: Refreshing state... [id=26880818]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.dmarc[0]: Refreshing state... [id=29377239]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.mail: Refreshing state... [id=29377236]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.srv_jmap: Refreshing state... [id=29377237]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.dkim[1]: Refreshing state... [id=29377245]
module.dnsimple_short_io.dnsimple_zone_record.a_record_2: Refreshing state... [id=37701472]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.dkim[2]: Refreshing state... [id=29377244]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.dkim[0]: Refreshing state... [id=29377241]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.srv_caldavs: Refreshing state... [id=29377247]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.dkim[2]: Refreshing state... [id=26880825]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.dkim[1]: Refreshing state... [id=26880824]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.dkim[0]: Refreshing state... [id=26880823]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_carddavs: Refreshing state... [id=26161972]
module.dnsimple_github_pages.dnsimple_zone_record.cname-record-www: Refreshing state... [id=26161971]
dnsimple_zone_record.google_workspace_verification: Refreshing state... [id=37701471]
dnsimple_zone_record.files_wtmn_net_alias: Refreshing state... [id=27004600]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_pop3s: Refreshing state... [id=26880821]
module.dnsimple_github_pages.dnsimple_zone_record.alias-record-root: Refreshing state... [id=37701462]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.mx_10[0]: Refreshing state... [id=37701459]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.dmarc[0]: Refreshing state... [id=26161945]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.mail: Refreshing state... [id=26161951]
module.dnsimple_short_io.dnsimple_zone_record.a_record_1: Refreshing state... [id=37701464]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.spf: Refreshing state... [id=37701456]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_submission: Refreshing state... [id=26161936]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_imaps: Refreshing state... [id=26161934]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_jmap: Refreshing state... [id=26161937]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_carddavs: Refreshing state... [id=26161943]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.mx_20[0]: Refreshing state... [id=37701468]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0943b6db76a7739351080289494]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0d9ae314d39edbd27]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0a9784bdb57c243ea]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-09ad1cd0279827ca1]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0c1fc26f6126c04ac1080289494]
aws_route53_zone.wtmn_net: Refreshing state... [id=Z093069418CSBZIY3FKFL]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-05ff3b9c888611b2f]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0303468ee527cc8b9]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0e8c10aa1c588d654]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-034e502974ae73a38]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-095ca1b9cf75035ff]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-08424b2403296c641]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0191c8107276df279]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0191c8107276df2791080289494]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-04377dc5c656bea81]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0be766c37852450f8]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0943b6db76a773935]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0ef25a17e6d6266a2]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-02e281cae2a8d793f]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-04fd39f49ec464d15]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0c1fc26f6126c04ac]
aws_route53_zone.witteman_me: Refreshing state... [id=Z05063061CYA524JAU8BC]
aws_key_pair.georgewitteman: Refreshing state... [id=georgewitteman-personal]
aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::866631827662:oidc-provider/token.actions.githubusercontent.com]
aws_s3_bucket.log_bucket: Refreshing state... [id=georgewitteman-terraform-logs]
aws_kms_key.dynamo_db_kms: Refreshing state... [id=1a1ca031-daf5-4f17-aa7d-2d2d2ca5a865]
aws_route53_zone.georgewitteman_com: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN]
aws_route53_zone.georgewitteman_me: Refreshing state... [id=Z0431101102WXYNRXVF0T]
aws_kms_key.primary_kms_key: Refreshing state... [id=d5eef806-22ba-4f53-a96f-3d3e6e545e07]
aws_s3_bucket.terraform_state: Refreshing state... [id=georgewitteman-terraform-state]
aws_route53_zone.marcywitteman_com: Refreshing state... [id=Z0939016Z0WL8RV5A0D1]
aws_dynamodb_table.terraform_locks: Refreshing state... [id=terraform-locks]
data.aws_iam_policy_document.github_oidc: Reading...
data.aws_iam_policy_document.github_oidc: Read complete after 0s [id=1151702415]
aws_iam_role.github_oidc: Refreshing state... [id=GitHubActionsOIDC]
aws_route53_record.wtmn_net_txt: Refreshing state... [id=Z093069418CSBZIY3FKFL__TXT]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_pop3s: Refreshing state... [id=Z093069418CSBZIY3FKFL__pop3s._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.mx: Refreshing state... [id=Z093069418CSBZIY3FKFL__MX]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_jmap: Refreshing state... [id=Z093069418CSBZIY3FKFL__jmap._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_carddavs: Refreshing state... [id=Z093069418CSBZIY3FKFL__carddavs._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_caldavs: Refreshing state... [id=Z093069418CSBZIY3FKFL__caldavs._tcp_SRV]
module.aws_fastmail_wtmn_net.data.aws_route53_zone.selected: Reading...
module.aws_fastmail_wtmn_net.aws_route53_record.srv_pop3: Refreshing state... [id=Z093069418CSBZIY3FKFL__pop3._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_imap: Refreshing state... [id=Z093069418CSBZIY3FKFL__imap._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_submission: Refreshing state... [id=Z093069418CSBZIY3FKFL__submission._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_caldav: Refreshing state... [id=Z093069418CSBZIY3FKFL__caldav._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_carddav: Refreshing state... [id=Z093069418CSBZIY3FKFL__carddav._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_imaps: Refreshing state... [id=Z093069418CSBZIY3FKFL__imaps._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.dmarc[0]: Refreshing state... [id=Z093069418CSBZIY3FKFL__dmarc_TXT]
module.aws_fastmail_wtmn_net.aws_route53_record.mail: Refreshing state... [id=Z093069418CSBZIY3FKFL_mail_A]
aws_route53_record.witteman_me_txt: Refreshing state... [id=Z05063061CYA524JAU8BC__TXT]
aws_route53_record.georgewitteman_me_txt: Refreshing state... [id=Z0431101102WXYNRXVF0T__TXT]
aws_route53_record.georgewitteman_com_txt: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__TXT]
aws_s3_bucket_acl.log_bucket: Refreshing state... [id=georgewitteman-terraform-logs,log-delivery-write]
module.aws_fastmail_wtmn_net.data.aws_route53_zone.selected: Read complete after 0s [id=Z093069418CSBZIY3FKFL]
aws_s3_bucket_server_side_encryption_configuration.log_bucket: Refreshing state... [id=georgewitteman-terraform-logs]
aws_s3_bucket_versioning.log_bucket: Refreshing state... [id=georgewitteman-terraform-logs]
aws_s3_bucket_public_access_block.log_bucket: Refreshing state... [id=georgewitteman-terraform-logs]
module.aws_fastmail_witteman_me.aws_route53_record.srv_imap: Refreshing state... [id=Z05063061CYA524JAU8BC__imap._tcp_SRV]
module.aws_fastmail_witteman_me.aws_route53_record.mail: Refreshing state... [id=Z05063061CYA524JAU8BC_mail_A]
module.aws_fastmail_witteman_me.aws_route53_record.srv_caldav: Refreshing state... [id=Z05063061CYA524JAU8BC__caldav._tcp_SRV]
module.aws_fastmail_witteman_me.aws_route53_record.srv_carddavs: Refreshing state... [id=Z05063061CYA524JAU8BC__carddavs._tcp_SRV]
module.aws_fastmail_witteman_me.aws_route53_record.srv_pop3: Refreshing state... [id=Z05063061CYA524JAU8BC__pop3._tcp_SRV]
module.aws_fastmail_witteman_me.aws_route53_record.srv_pop3s: Refreshing state... [id=Z05063061CYA524JAU8BC__pop3s._tcp_SRV]
module.aws_fastmail_witteman_me.aws_route53_record.srv_jmap: Refreshing state... [id=Z05063061CYA524JAU8BC__jmap._tcp_SRV]
module.aws_fastmail_witteman_me.aws_route53_record.srv_imaps: Refreshing state... [id=Z05063061CYA524JAU8BC__imaps._tcp_SRV]
module.aws_fastmail_witteman_me.aws_route53_record.srv_caldavs: Refreshing state... [id=Z05063061CYA524JAU8BC__caldavs._tcp_SRV]
module.aws_fastmail_witteman_me.aws_route53_record.dmarc[0]: Refreshing state... [id=Z05063061CYA524JAU8BC__dmarc_TXT]
module.aws_fastmail_witteman_me.aws_route53_record.srv_carddav: Refreshing state... [id=Z05063061CYA524JAU8BC__carddav._tcp_SRV]
module.aws_fastmail_witteman_me.data.aws_route53_zone.selected: Reading...
module.aws_fastmail_witteman_me.aws_route53_record.mx: Refreshing state... [id=Z05063061CYA524JAU8BC__MX]
module.aws_fastmail_witteman_me.aws_route53_record.srv_submission: Refreshing state... [id=Z05063061CYA524JAU8BC__submission._tcp_SRV]
aws_s3_bucket_public_access_block.terraform_state: Refreshing state... [id=georgewitteman-terraform-state]
aws_s3_bucket_logging.terraform_state: Refreshing state... [id=georgewitteman-terraform-state]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_pop3: Refreshing state... [id=Z0431101102WXYNRXVF0T__pop3._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_imap: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__imap._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.mx: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__MX]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_pop3s: Refreshing state... [id=Z0431101102WXYNRXVF0T__pop3s._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.mail: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN_mail_A]
aws_s3_bucket_server_side_encryption_configuration.terraform_state: Refreshing state... [id=georgewitteman-terraform-state]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_pop3: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__pop3._tcp_SRV]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_imap: Refreshing state... [id=Z0431101102WXYNRXVF0T__imap._tcp_SRV]
module.aws_fastmail_witteman_me.data.aws_route53_zone.selected: Read complete after 1s [id=Z05063061CYA524JAU8BC]
module.aws_fastmail_georgewitteman_me.aws_route53_record.dmarc[0]: Refreshing state... [id=Z0431101102WXYNRXVF0T__dmarc_TXT]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_carddav: Refreshing state... [id=Z0431101102WXYNRXVF0T__carddav._tcp_SRV]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_submission: Refreshing state... [id=Z0431101102WXYNRXVF0T__submission._tcp_SRV]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_caldavs: Refreshing state... [id=Z0431101102WXYNRXVF0T__caldavs._tcp_SRV]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_jmap: Refreshing state... [id=Z0431101102WXYNRXVF0T__jmap._tcp_SRV]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_carddavs: Refreshing state... [id=Z0431101102WXYNRXVF0T__carddavs._tcp_SRV]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_imaps: Refreshing state... [id=Z0431101102WXYNRXVF0T__imaps._tcp_SRV]
module.aws_fastmail_georgewitteman_me.data.aws_route53_zone.selected: Reading...
module.aws_fastmail_georgewitteman_me.aws_route53_record.mail: Refreshing state... [id=Z0431101102WXYNRXVF0T_mail_A]
module.aws_fastmail_georgewitteman_me.aws_route53_record.mx: Refreshing state... [id=Z0431101102WXYNRXVF0T__MX]
module.aws_fastmail_georgewitteman_me.data.aws_route53_zone.selected: Read complete after 1s [id=Z0431101102WXYNRXVF0T]
module.aws_fastmail_georgewitteman_com.data.aws_route53_zone.selected: Reading...
aws_s3_bucket_versioning.terraform_state: Refreshing state... [id=georgewitteman-terraform-state]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_submission: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__submission._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.dmarc[0]: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__dmarc_TXT]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_caldav: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__caldav._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_carddavs: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__carddavs._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_jmap: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__jmap._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_imaps: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__imaps._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_caldavs: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__caldavs._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_pop3s: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__pop3s._tcp_SRV]
module.aws_fastmail_georgewitteman_com.data.aws_route53_zone.selected: Read complete after 4s [id=Z04997513SHTSY0FZ1ZPN]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_carddav: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__carddav._tcp_SRV]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_caldav: Refreshing state... [id=Z0431101102WXYNRXVF0T__caldav._tcp_SRV]
module.aws_squarespace_marcywitteman_com.aws_route53_record.www_cname: Refreshing state... [id=Z0939016Z0WL8RV5A0D1_www_CNAME]
module.aws_squarespace_marcywitteman_com.aws_route53_record.a: Refreshing state... [id=Z0939016Z0WL8RV5A0D1__A]
module.aws_squarespace_marcywitteman_com.aws_route53_record.verify_cname: Refreshing state... [id=Z0939016Z0WL8RV5A0D1_ygcg8lysbebsftxsez6l_CNAME]
module.aws_fastmail_wtmn_net.aws_route53_record.dkim["fm3"]: Refreshing state... [id=Z093069418CSBZIY3FKFL_fm3._domainkey_CNAME]
module.aws_fastmail_wtmn_net.aws_route53_record.dkim["fm1"]: Refreshing state... [id=Z093069418CSBZIY3FKFL_fm1._domainkey_CNAME]
module.aws_fastmail_wtmn_net.aws_route53_record.dkim["fm2"]: Refreshing state... [id=Z093069418CSBZIY3FKFL_fm2._domainkey_CNAME]
module.aws_fastmail_witteman_me.aws_route53_record.dkim["fm3"]: Refreshing state... [id=Z05063061CYA524JAU8BC_fm3._domainkey_CNAME]
module.aws_fastmail_witteman_me.aws_route53_record.dkim["fm1"]: Refreshing state... [id=Z05063061CYA524JAU8BC_fm1._domainkey_CNAME]
module.aws_fastmail_witteman_me.aws_route53_record.dkim["fm2"]: Refreshing state... [id=Z05063061CYA524JAU8BC_fm2._domainkey_CNAME]
module.aws_fastmail_georgewitteman_me.aws_route53_record.dkim["fm3"]: Refreshing state... [id=Z0431101102WXYNRXVF0T_fm3._domainkey_CNAME]
module.aws_fastmail_georgewitteman_me.aws_route53_record.dkim["fm1"]: Refreshing state... [id=Z0431101102WXYNRXVF0T_fm1._domainkey_CNAME]
module.aws_fastmail_georgewitteman_me.aws_route53_record.dkim["fm2"]: Refreshing state... [id=Z0431101102WXYNRXVF0T_fm2._domainkey_CNAME]
module.aws_fastmail_georgewitteman_com.aws_route53_record.dkim["fm2"]: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN_fm2._domainkey_CNAME]
module.aws_fastmail_georgewitteman_com.aws_route53_record.dkim["fm3"]: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN_fm3._domainkey_CNAME]
module.aws_fastmail_georgewitteman_com.aws_route53_record.dkim["fm1"]: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN_fm1._domainkey_CNAME]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "main-us-east-1a"
        }
      + tags_all             = {
          + "Name"       = "main-us-east-1a"
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
      + vpc                  = (known after apply)
    }

  # aws_eip.nat[1] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "main-us-east-1b"
        }
      + tags_all             = {
          + "Name"       = "main-us-east-1b"
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
      + vpc                  = (known after apply)
    }

  # aws_internet_gateway.this will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "main"
        }
      + tags_all = {
          + "Name"       = "main"
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
      + vpc_id   = (known after apply)
    }

  # aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "main-us-east-1a"
        }
      + tags_all             = {
          + "Name"       = "main-us-east-1a"
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
    }

  # aws_nat_gateway.this[1] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "main-us-east-1b"
        }
      + tags_all             = {
          + "Name"       = "main-us-east-1b"
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
    }

  # aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.private_nat_gateway[1] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.public_internet_gateway will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "main-public-us-east-1a"
        }
      + tags_all         = {
          + "Name"       = "main-public-us-east-1a"
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "main-public-us-east-1b"
        }
      + tags_all         = {
          + "Name"       = "main-public-us-east-1b"
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "main-public"
        }
      + tags_all         = {
          + "Name"       = "main-public"
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.16.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "main-private-us-east-1a"
        }
      + tags_all                                       = {
          + "Name"       = "main-private-us-east-1a"
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.17.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "main-private-us-east-1b"
        }
      + tags_all                                       = {
          + "Name"       = "main-private-us-east-1b"
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "main-public-us-east-1a"
        }
      + tags_all                                       = {
          + "Name"       = "main-public-us-east-1a"
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "main-public-us-east-1b"
        }
      + tags_all                                       = {
          + "Name"       = "main-public-us-east-1b"
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.this will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "main"
        }
      + tags_all                             = {
          + "Name"       = "main"
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
    }

  # module.vpc.aws_eip.nat[0] will be destroyed
  # (because aws_eip.nat is not in configuration)
  - resource "aws_eip" "nat" {
      - allocation_id        = "eipalloc-0e8c10aa1c588d654" -> null
      - association_id       = "eipassoc-0acdd917cbe9983ae" -> null
      - domain               = "vpc" -> null
      - id                   = "eipalloc-0e8c10aa1c588d654" -> null
      - network_border_group = "us-east-1" -> null
      - network_interface    = "eni-097a0f9c42328cfb3" -> null
      - private_dns          = "ip-10-0-0-50.ec2.internal" -> null
      - private_ip           = "10.0.0.50" -> null
      - public_dns           = "ec2-34-234-122-142.compute-1.amazonaws.com" -> null
      - public_ip            = "34.234.122.142" -> null
      - public_ipv4_pool     = "amazon" -> null
      - tags                 = {
          - "Name" = "main-us-east-1a"
        } -> null
      - tags_all             = {
          - "Name"       = "main-us-east-1a"
          - "Repository" = "georgewitteman/terraform"
          - "Terraform"  = "true"
        } -> null
      - vpc                  = true -> null
    }

  # module.vpc.aws_eip.nat[1] will be destroyed
  # (because aws_eip.nat is not in configuration)
  - resource "aws_eip" "nat" {
      - allocation_id        = "eipalloc-02e281cae2a8d793f" -> null
      - association_id       = "eipassoc-02ea34b1c50b6104d" -> null
      - domain               = "vpc" -> null
      - id                   = "eipalloc-02e281cae2a8d793f" -> null
      - network_border_group = "us-east-1" -> null
      - network_interface    = "eni-07f35ab5856163bf6" -> null
      - private_dns          = "ip-10-0-1-62.ec2.internal" -> null
      - private_ip           = "10.0.1.62" -> null
      - public_dns           = "ec2-44-193-58-121.compute-1.amazonaws.com" -> null
      - public_ip            = "44.193.58.121" -> null
      - public_ipv4_pool     = "amazon" -> null
      - tags                 = {
          - "Name" = "main-us-east-1b"
        } -> null
      - tags_all             = {
          - "Name"       = "main-us-east-1b"
          - "Repository" = "georgewitteman/terraform"
          - "Terraform"  = "true"
        } -> null
      - vpc                  = true -> null
    }

  # module.vpc.aws_internet_gateway.this[0] will be destroyed
  # (because aws_internet_gateway.this is not in configuration)
  - resource "aws_internet_gateway" "this" {
      - arn      = "arn:aws:ec2:us-east-1:866631827662:internet-gateway/igw-05ff3b9c888611b2f" -> null
      - id       = "igw-05ff3b9c888611b2f" -> null
      - owner_id = "866631827662" -> null
      - tags     = {
          - "Name" = "main"
        } -> null
      - tags_all = {
          - "Name"       = "main"
          - "Repository" = "georgewitteman/terraform"
          - "Terraform"  = "true"
        } -> null
      - vpc_id   = "vpc-0a9784bdb57c243ea" -> null
    }

  # module.vpc.aws_nat_gateway.this[0] will be destroyed
  # (because aws_nat_gateway.this is not in configuration)
  - resource "aws_nat_gateway" "this" {
      - allocation_id        = "eipalloc-0e8c10aa1c588d654" -> null
      - connectivity_type    = "public" -> null
      - id                   = "nat-095ca1b9cf75035ff" -> null
      - network_interface_id = "eni-097a0f9c42328cfb3" -> null
      - private_ip           = "10.0.0.50" -> null
      - public_ip            = "34.234.122.142" -> null
      - subnet_id            = "subnet-04377dc5c656bea81" -> null
      - tags                 = {
          - "Name" = "main-us-east-1a"
        } -> null
      - tags_all             = {
          - "Name"       = "main-us-east-1a"
          - "Repository" = "georgewitteman/terraform"
          - "Terraform"  = "true"
        } -> null
    }

  # module.vpc.aws_nat_gateway.this[1] will be destroyed
  # (because aws_nat_gateway.this is not in configuration)
  - resource "aws_nat_gateway" "this" {
      - allocation_id        = "eipalloc-02e281cae2a8d793f" -> null
      - connectivity_type    = "public" -> null
      - id                   = "nat-0303468ee527cc8b9" -> null
      - network_interface_id = "eni-07f35ab5856163bf6" -> null
      - private_ip           = "10.0.1.62" -> null
      - public_ip            = "44.193.58.121" -> null
      - subnet_id            = "subnet-08424b2403296c641" -> null
      - tags                 = {
          - "Name" = "main-us-east-1b"
        } -> null
      - tags_all             = {
          - "Name"       = "main-us-east-1b"
          - "Repository" = "georgewitteman/terraform"
          - "Terraform"  = "true"
        } -> null
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be destroyed
  # (because aws_route.private_nat_gateway is not in configuration)
  - resource "aws_route" "private_nat_gateway" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - id                     = "r-rtb-0943b6db76a7739351080289494" -> null
      - nat_gateway_id         = "nat-095ca1b9cf75035ff" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-0943b6db76a773935" -> null
      - state                  = "active" -> null

      - timeouts {
          - create = "5m" -> null
        }
    }

  # module.vpc.aws_route.private_nat_gateway[1] will be destroyed
  # (because aws_route.private_nat_gateway is not in configuration)
  - resource "aws_route" "private_nat_gateway" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - id                     = "r-rtb-0191c8107276df2791080289494" -> null
      - nat_gateway_id         = "nat-0303468ee527cc8b9" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-0191c8107276df279" -> null
      - state                  = "active" -> null

      - timeouts {
          - create = "5m" -> null
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be destroyed
  # (because aws_route.public_internet_gateway is not in configuration)
  - resource "aws_route" "public_internet_gateway" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - gateway_id             = "igw-05ff3b9c888611b2f" -> null
      - id                     = "r-rtb-0c1fc26f6126c04ac1080289494" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-0c1fc26f6126c04ac" -> null
      - state                  = "active" -> null

      - timeouts {
          - create = "5m" -> null
        }
    }

  # module.vpc.aws_route_table.private[0] will be destroyed
  # (because aws_route_table.private is not in configuration)
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:us-east-1:866631827662:route-table/rtb-0943b6db76a773935" -> null
      - id               = "rtb-0943b6db76a773935" -> null
      - owner_id         = "866631827662" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-095ca1b9cf75035ff"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Name" = "main-private-us-east-1a"
        } -> null
      - tags_all         = {
          - "Name"       = "main-private-us-east-1a"
          - "Repository" = "georgewitteman/terraform"
          - "Terraform"  = "true"
        } -> null
      - vpc_id           = "vpc-0a9784bdb57c243ea" -> null
    }

  # module.vpc.aws_route_table.private[1] will be destroyed
  # (because aws_route_table.private is not in configuration)
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:us-east-1:866631827662:route-table/rtb-0191c8107276df279" -> null
      - id               = "rtb-0191c8107276df279" -> null
      - owner_id         = "866631827662" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-0303468ee527cc8b9"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Name" = "main-private-us-east-1b"
        } -> null
      - tags_all         = {
          - "Name"       = "main-private-us-east-1b"
          - "Repository" = "georgewitteman/terraform"
          - "Terraform"  = "true"
        } -> null
      - vpc_id           = "vpc-0a9784bdb57c243ea" -> null
    }

  # module.vpc.aws_route_table.public[0] will be destroyed
  # (because aws_route_table.public is not in configuration)
  - resource "aws_route_table" "public" {
      - arn              = "arn:aws:ec2:us-east-1:866631827662:route-table/rtb-0c1fc26f6126c04ac" -> null
      - id               = "rtb-0c1fc26f6126c04ac" -> null
      - owner_id         = "866631827662" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = "igw-05ff3b9c888611b2f"
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Name" = "main-public"
        } -> null
      - tags_all         = {
          - "Name"       = "main-public"
          - "Repository" = "georgewitteman/terraform"
          - "Terraform"  = "true"
        } -> null
      - vpc_id           = "vpc-0a9784bdb57c243ea" -> null
    }

  # module.vpc.aws_route_table_association.private[0] will be destroyed
  # (because aws_route_table_association.private is not in configuration)
  - resource "aws_route_table_association" "private" {
      - id             = "rtbassoc-04fd39f49ec464d15" -> null
      - route_table_id = "rtb-0943b6db76a773935" -> null
      - subnet_id      = "subnet-0ef25a17e6d6266a2" -> null
    }

  # module.vpc.aws_route_table_association.private[1] will be destroyed
  # (because aws_route_table_association.private is not in configuration)
  - resource "aws_route_table_association" "private" {
      - id             = "rtbassoc-09ad1cd0279827ca1" -> null
      - route_table_id = "rtb-0191c8107276df279" -> null
      - subnet_id      = "subnet-0be766c37852450f8" -> null
    }

  # module.vpc.aws_route_table_association.public[0] will be destroyed
  # (because aws_route_table_association.public is not in configuration)
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-034e502974ae73a38" -> null
      - route_table_id = "rtb-0c1fc26f6126c04ac" -> null
      - subnet_id      = "subnet-04377dc5c656bea81" -> null
    }

  # module.vpc.aws_route_table_association.public[1] will be destroyed
  # (because aws_route_table_association.public is not in configuration)
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-0d9ae314d39edbd27" -> null
      - route_table_id = "rtb-0c1fc26f6126c04ac" -> null
      - subnet_id      = "subnet-08424b2403296c641" -> null
    }

  # module.vpc.aws_subnet.private[0] will be destroyed
  # (because aws_subnet.private is not in configuration)
  - resource "aws_subnet" "private" {
      - arn                                            = "arn:aws:ec2:us-east-1:866631827662:subnet/subnet-0ef25a17e6d6266a2" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1a" -> null
      - availability_zone_id                           = "use1-az2" -> null
      - cidr_block                                     = "10.0.16.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0ef25a17e6d6266a2" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "866631827662" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "main-private-us-east-1a"
        } -> null
      - tags_all                                       = {
          - "Name"       = "main-private-us-east-1a"
          - "Repository" = "georgewitteman/terraform"
          - "Terraform"  = "true"
        } -> null
      - vpc_id                                         = "vpc-0a9784bdb57c243ea" -> null
    }

  # module.vpc.aws_subnet.private[1] will be destroyed
  # (because aws_subnet.private is not in configuration)
  - resource "aws_subnet" "private" {
      - arn                                            = "arn:aws:ec2:us-east-1:866631827662:subnet/subnet-0be766c37852450f8" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1b" -> null
      - availability_zone_id                           = "use1-az4" -> null
      - cidr_block                                     = "10.0.17.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0be766c37852450f8" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "866631827662" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "main-private-us-east-1b"
        } -> null
      - tags_all                                       = {
          - "Name"       = "main-private-us-east-1b"
          - "Repository" = "georgewitteman/terraform"
          - "Terraform"  = "true"
        } -> null
      - vpc_id                                         = "vpc-0a9784bdb57c243ea" -> null
    }

  # module.vpc.aws_subnet.public[0] will be destroyed
  # (because aws_subnet.public is not in configuration)
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:us-east-1:866631827662:subnet/subnet-04377dc5c656bea81" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1a" -> null
      - availability_zone_id                           = "use1-az2" -> null
      - cidr_block                                     = "10.0.0.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-04377dc5c656bea81" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "866631827662" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "main-public-us-east-1a"
        } -> null
      - tags_all                                       = {
          - "Name"       = "main-public-us-east-1a"
          - "Repository" = "georgewitteman/terraform"
          - "Terraform"  = "true"
        } -> null
      - vpc_id                                         = "vpc-0a9784bdb57c243ea" -> null
    }

  # module.vpc.aws_subnet.public[1] will be destroyed
  # (because aws_subnet.public is not in configuration)
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:us-east-1:866631827662:subnet/subnet-08424b2403296c641" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1b" -> null
      - availability_zone_id                           = "use1-az4" -> null
      - cidr_block                                     = "10.0.1.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-08424b2403296c641" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "866631827662" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "main-public-us-east-1b"
        } -> null
      - tags_all                                       = {
          - "Name"       = "main-public-us-east-1b"
          - "Repository" = "georgewitteman/terraform"
          - "Terraform"  = "true"
        } -> null
      - vpc_id                                         = "vpc-0a9784bdb57c243ea" -> null
    }

  # module.vpc.aws_vpc.this[0] will be destroyed
  # (because aws_vpc.this is not in configuration)
  - resource "aws_vpc" "this" {
      - arn                              = "arn:aws:ec2:us-east-1:866631827662:vpc/vpc-0a9784bdb57c243ea" -> null
      - assign_generated_ipv6_cidr_block = false -> null
      - cidr_block                       = "10.0.0.0/16" -> null
      - default_network_acl_id           = "acl-047d9ff3e4fb588ff" -> null
      - default_route_table_id           = "rtb-093d0f358d74aff90" -> null
      - default_security_group_id        = "sg-054bd0bd5b44280a3" -> null
      - dhcp_options_id                  = "dopt-3bc44d41" -> null
      - enable_classiclink               = false -> null
      - enable_classiclink_dns_support   = false -> null
      - enable_dns_hostnames             = false -> null
      - enable_dns_support               = true -> null
      - id                               = "vpc-0a9784bdb57c243ea" -> null
      - instance_tenancy                 = "default" -> null
      - ipv6_netmask_length              = 0 -> null
      - main_route_table_id              = "rtb-093d0f358d74aff90" -> null
      - owner_id                         = "866631827662" -> null
      - tags                             = {
          - "Name" = "main"
        } -> null
      - tags_all                         = {
          - "Name"       = "main"
          - "Repository" = "georgewitteman/terraform"
          - "Terraform"  = "true"
        } -> null
    }

Plan: 20 to add, 0 to change, 20 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @georgewitteman, Action: `pull_request`*